SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rtc.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/
 
/**
*\*\file n32g430_rtc.c
*\*\author Nations
*\*\version v1.0.1
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/
 
#include "n32g430_rtc.h"
#include "n32g430_rcc.h"
#include "stdio.h"

static void RTC_Hour_Format_Set(uint32_t hour_format);
static void RTC_Prescale_Config(uint32_t synch_prediv, uint32_t asynch_prediv);
static void RTC_Registers_Reset(void);
static uint8_t RTC_Byte_To_Bcd2(uint8_t Value);
static uint8_t RTC_Bcd2_To_Byte(uint8_t Value);

/**
*\*\name    RTC_Structure_Initializes.
*\*\fun     Fills each RTC_InitStruct member with its default value.
*\*\param   RTC_InitStruct :    RTC_InitStruct pointer to a RTC_InitType structure which will beinitialized. 
*\*\            - RTC_HourFormat
*\*\                - RTC_24HOUR_FORMAT
*\*\                - RTC_12HOUR_FORMAT
*\*\            - RTC_AsynchPrediv  the value must lower than 0x7F
*\*\            - RTC_SynchPrediv   the value must lower than 0x7FFF          
*\*\return  none
**/
void RTC_Structure_Initializes(RTC_InitType* RTC_InitStruct)
{
    /* Initialize the RTC_HourFormat member */
    RTC_InitStruct->RTC_HourFormat = RTC_24HOUR_FORMAT;
    /* Initialize the RTC_AsynchPrediv member */
    RTC_InitStruct->RTC_AsynchPrediv = (uint32_t)0x7F;
    /* Initialize the RTC_SynchPrediv member */
    RTC_InitStruct->RTC_SynchPrediv = (uint32_t)0xFF;
}

/**
*\*\name    RTC_Write_Protection_Enable.
*\*\fun     Enable the RTC registers write protection.
*\*\param   none
*\*\return  none
**/
void RTC_Write_Protection_Enable(void)
{
    /* Enable the write protection for RTC registers */
    RTC->WRP = 0xFF;
}

/**
*\*\name    RTC_Write_Protection_Disable.
*\*\fun     Disable the RTC registers write protection.
*\*\param   none
*\*\return  none
**/
void RTC_Write_Protection_Disable(void)
{
    /* Disable the write protection for RTC registers */
    RTC->WRP = 0xCA;
    RTC->WRP = 0x53;
}

/**
*\*\name    RTC_Initialization_Mode_Enter.
*\*\fun     Enters the RTC Initialization mode.
*\*\return   ErrorStatus
*\*\            - SUCCESS: RTC is in Init mode
*\*\            - ERROR: RTC is not in Init mode
**/
ErrorStatus RTC_Initialization_Mode_Enter(void)
{
    uint32_t temp_value = 0x00;
    uint32_t temp_value1 = 0x00;
    
    /* Check if the Initialization mode is set */
    if ((RTC->INITSTS & RTC_FLAG_INITF) == (uint32_t)RESET)
    {
        /* Set the Initialization mode */
        RTC->INITSTS = (uint32_t)RTC_FLAG_INITM;

        /* Wait untill RTC is in INIT state and if Time out is reached exit */
        do
        {
            temp_value1 = RTC->INITSTS & RTC_FLAG_INITF;
            temp_value++;
        } while ((temp_value != INITMODE_TIMEOUT) && (temp_value1 == 0x00));

        if ((RTC->INITSTS & RTC_FLAG_INITF) != RESET)
        {
            return SUCCESS;
        }
        else
        {
            return ERROR;
        }
    }
    else
    {
        return SUCCESS;
    }
}

/**
*\*\name    RTC_Initialization_Mode_Exit.
*\*\fun     When the initialization sequence is complete, the calendar restarts counting after 4 RTCCLK cycles.
*\*\return  none
**/
void RTC_Initialization_Mode_Exit(void)
{
    /* Exit Initialization mode */
    RTC->INITSTS &= (uint32_t)~RTC_FLAG_INITM;
}

/**
*\*\name    RTC_Hour_Format_Set.
*\*\fun     Set RTC hour format.
*\*\param   hour_format :
*\*\            - RTC_24HOUR_FORMAT
*\*\            - RTC_12HOUR_FORMAT
*\*\return  none
**/
static void RTC_Hour_Format_Set(uint32_t hour_format)
{
    /* Clear RTC CTRL HFMT Bit */
    RTC->CTRL &= ((uint32_t) ~(RTC_CTRL_HFMT));
    /* Set RTC_CTRL register */
    RTC->CTRL |= hour_format;
}

/**
*\*\name    RTC_Prescale_Config.
*\*\fun     Set RTC prescale.
*\*\param   synch_prediv    the value in the 0-0x7F range
*\*\param   asynch_prediv   the value in the 0-0x7FFF range
*\*\return  none
**/
static void RTC_Prescale_Config(uint32_t synch_prediv, uint32_t asynch_prediv)
{
    RTC->PRE = synch_prediv;
    RTC->PRE |= (uint32_t)(asynch_prediv << 16);
}

/**
*\*\name    RTC_Registers_Reset.
*\*\fun     Reset RTC registers.
*\*\param   none
*\*\return  none
**/
static void RTC_Registers_Reset(void)
{
    /* Reset RTC registers */
    RTC->CTRL   &= (uint32_t)0x00000000;
    RTC->WKUPT   = (uint32_t)0x0000FFFF;
    RTC->PRE     = (uint32_t)0x007F00FF;
    RTC->ALARMA  = (uint32_t)0x00000000;
    RTC->ALARMB  = (uint32_t)0x00000000;
    RTC->SCTRL   = (uint32_t)0x00000000;
    RTC->CALIB   = (uint32_t)0x00000000;
    RTC->ALRMASS = (uint32_t)0x00000000;
    RTC->ALRMBSS = (uint32_t)0x00000000;

