SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rtc.c
    /* Get the RTC_TSH register */
    temp_value = (uint32_t)(RTC->TSH & RTC_TR_RESERVED_MASK);

    /* Fill the structure fields with the read parameters */
    RTC_TimeStruct->Hours   = (uint8_t)((temp_value & (RTC_TSH_HOT | RTC_TSH_HOU)) >> 16);
    RTC_TimeStruct->Minutes = (uint8_t)((temp_value & (RTC_TSH_MIT | RTC_TSH_MIU)) >> 8);
    RTC_TimeStruct->Seconds = (uint8_t)(temp_value & (RTC_TSH_SCT | RTC_TSH_SCU));
    RTC_TimeStruct->H12     = (uint8_t)((temp_value & (RTC_TSH_APM)) >> 16);

    /* Check the input parameters format */
    if (RTC_Format == RTC_FORMAT_BIN)
    {
        /* Convert the structure parameters to Binary format */
        RTC_TimeStruct->Hours   = (uint8_t)RTC_Bcd2_To_Byte(RTC_TimeStruct->Hours);
        RTC_TimeStruct->Minutes = (uint8_t)RTC_Bcd2_To_Byte(RTC_TimeStruct->Minutes);
        RTC_TimeStruct->Seconds = (uint8_t)RTC_Bcd2_To_Byte(RTC_TimeStruct->Seconds);
    }
}

/**
*\*\name    RTC_SubSecond_Get.
*\*\fun     Gets the RTC current Calendar Subseconds value.
*\*\return  RTC current Calendar Subseconds value. 
**/
uint32_t RTC_SubSecond_Get(void)
{
    /* Get subseconds values from the correspondent registers*/
    return RTC->SUBS;
}

#ifdef RTC_DELAY_USE_TIM6
#define RTC_DELAY_1S_PRESCALER_VALUE_TIM6 (100)
#define RTC_DELAY_1S_RELOAD_VALUE_TIM6    (SystemClockFrequency/1000)
static NVIC_InitType TIM6_NVIC_Init;
#else
#define RTC_DELAY_1S_RELOAD_VALUE_SYSTICK (SystemClockFrequency/10)
#endif

volatile uint32_t RTC_Delay_Flag = 0;

/**
*\*\name    RTC_Calendar_Initializes.
*\*\fun     Calendar initialization configuration.
*\*\param   RTC_Format : specifies the format of the returned parameters.
*\*\          - RTC_FORMAT_BIN 
*\*\          - RTC_FORMAT_BCD 
*\*\param   RTC_InitStruct: pointer to a RTC_InitType structure that contains the configuration
*\*\        information for the RTC peripheral.When the user does not need to configure this 
*\*\        parameter, note that NULL can be passed in. 
*\*\            - RTC_HourFormat
*\*\                - RTC_24HOUR_FORMAT
*\*\                - RTC_12HOUR_FORMAT
*\*\            - RTC_AsynchPrediv  the value in the 0-0x7F range
*\*\            - RTC_SynchPrediv   the value in the 0-0x7FFF range
*\*\param   RTC_DateStruct : RTC_DateStruct pointer to a RTC_DateType structure that contains
*\*\        the date configuration information for the RTC,note that NULL can be passed in.
*\*\            - WeekDay 
*\*\                - RTC_WEEKDAY_MONDAY
*\*\                - RTC_WEEKDAY_TUESDAY
*\*\                - RTC_WEEKDAY_WEDNESDAY
*\*\                - RTC_WEEKDAY_THURSDAY
*\*\                - RTC_WEEKDAY_FRIDAY
*\*\                - RTC_WEEKDAY_SATURDAY
*\*\                - RTC_WEEKDAY_SUNDAY
*\*\            - Month 
*\*\                - RTC_MONTH_JANUARY
*\*\                - RTC_MONTH_FEBRURY
*\*\                - RTC_MONTH_MARCH
*\*\                - RTC_MONTH_APRIL
*\*\                - RTC_MONTH_MAY
*\*\                - RTC_MONTH_JUNE
*\*\                - RTC_MONTH_JULY
*\*\                - RTC_MONTH_AUGUST
*\*\                - RTC_MONTH_SEPTEMBER
*\*\                - RTC_MONTH_OCTOBER
*\*\                - RTC_MONTH_NOVEMBER
*\*\                - RTC_MONTH_DECEMBER
*\*\            - Date    the value in the 1-31 range 
*\*\            - Year    the value in the 0-99 range
*\*\param   RTC_TimeStruct : RTC_TimeStruct pointer to a RTC_TimeType structure that contains
*\*\        the time configuration information for the RTC.When the user does not need to configure this 
*\*\        parameter, note that NULL can be passed in.
*\*\            - Hours
*\*\                - if RTC_AM_H12 is select the value in the 0-23 range
*\*\                - if RTC_PM_H12 is select the value in the 1-12 range
*\*\            - Minutes  the value set in the 0-59 range
*\*\            - Seconds  the value set in the 0-59 range
*\*\            - H12
*\*\                - RTC_AM_H12
*\*\                - RTC_PM_H12
*\*\param   RTC_DelayCmd: Enable or disable 1 second delay.
*\*\        This parameter can be: ENABLE or DISABLE.
*\*\  Note: 1. This parameter is configured according to the user's needs. If the user needs
*\*\        to call this function multiple times within 1 second to configure the calendar, it must
*\*\        be enabled, because we stipulate that the interval between two calendar configurations 
*\*\        must be at least 1 second.
*\*\        2. If this parameter is enabled, We provide two timers to help users complete this delay 
*\*\        operation (SysTick and TIM6). Users can choose which timer to use according to their needs,
*\*\        and use the macro RTC_DELAY_USE_TIM6 to select. At the same time, the user should also pay  
*\*\        attention to the usage of the watchdog. If necessary, the dog can be fed in the interrupt 
*\*\        handler to prevent the watchdog generating a system reset due to the delay in this function.
*\*\return  ErrorStatus
*\*\            - SUCCESS:  RTC PRE register, Date register, Time register is configured
*\*\            - ERROR:    RTC PRE register, Date register, Time register is not configured
**/
ErrorStatus RTC_Calendar_Initializes(uint32_t RTC_Format, RTC_InitType* RTC_InitStruct, RTC_DateType* RTC_DateStruct, RTC_TimeType* RTC_TimeStruct, FunctionalState RTC_DelayCmd)
{
    static uint32_t first_init_flag = 1;
    uint32_t temp_value1 = 0, temp_value2 = 0;
    ErrorStatus status_value    = ERROR;
    
    if(RTC_DateStruct != NULL)
    {
        if ((RTC_Format == RTC_FORMAT_BIN) && ((RTC_DateStruct->Month & 0x10) == 0x10))
        {
            RTC_DateStruct->Month = (RTC_DateStruct->Month & (uint32_t) ~(0x10)) + 0x0A;
        }
    }
    
    /* Check the input parameters format */
    if (RTC_Format != RTC_FORMAT_BIN)
    {
        if(RTC_DateStruct != NULL)
        {
            temp_value1 = ((((uint32_t)RTC_DateStruct->Year) << 16) | (((uint32_t)RTC_DateStruct->Month) << 8)
                       | ((uint32_t)RTC_DateStruct->Date) | (((uint32_t)RTC_DateStruct->WeekDay) << 13));
        }
        
