SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rtc.c
        if(RTC_TimeStruct != NULL)
        {
            temp_value2 = (((uint32_t)(RTC_TimeStruct->Hours) << 16) | ((uint32_t)(RTC_TimeStruct->Minutes) << 8)
                       | ((uint32_t)RTC_TimeStruct->Seconds) | ((uint32_t)(RTC_TimeStruct->H12) << 16));
        }
    }
    else
    {
        if(RTC_DateStruct != NULL)
        {
            temp_value1 = (((uint32_t)RTC_Byte_To_Bcd2(RTC_DateStruct->Year) << 16)
                       | ((uint32_t)RTC_Byte_To_Bcd2(RTC_DateStruct->Month) << 8)
                       | ((uint32_t)RTC_Byte_To_Bcd2(RTC_DateStruct->Date)) | ((uint32_t)RTC_DateStruct->WeekDay << 13));
        }
        
        if(RTC_TimeStruct != NULL)
        {
            temp_value2 = (uint32_t)(((uint32_t)RTC_Byte_To_Bcd2(RTC_TimeStruct->Hours) << 16)
                       | ((uint32_t)RTC_Byte_To_Bcd2(RTC_TimeStruct->Minutes) << 8)
                       | ((uint32_t)RTC_Byte_To_Bcd2(RTC_TimeStruct->Seconds)) | (((uint32_t)RTC_TimeStruct->H12) << 16));
        }
    }

    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    if(RTC_DelayCmd == ENABLE)
    {
        /* The first initialization does not execute the delay */
        if(!first_init_flag)
        {
            /* Wait for the 1.1 second delay flag to be set */
            while(!RTC_Delay_Flag);
            RTC_Delay_Flag = 0;
        }
    }
    /* Set Initialization mode */
    if (RTC_Initialization_Mode_Enter() == ERROR)
    {
        status_value = ERROR;
    }
    else
    {
        if(RTC_InitStruct != NULL)
        {
            /* Set rtc hour format*/
            RTC_Hour_Format_Set(RTC_InitStruct->RTC_HourFormat);
            /* Configure the RTC PRE */
            RTC_Prescale_Config(RTC_InitStruct->RTC_SynchPrediv, RTC_InitStruct->RTC_AsynchPrediv);
        }

        if(RTC_DateStruct != NULL)
        {
            /* Set the RTC_DATE register */
            RTC->DATE = (uint32_t)(temp_value1 & RTC_DATE_RESERVED_MASK);
        }

        if(RTC_TimeStruct != NULL)
        {
            /* Set the RTC_TSH register */
            RTC->TSH = (uint32_t)(temp_value2 & RTC_TR_RESERVED_MASK);
        }
        
        /* Exit Initialization mode */
        RTC_Initialization_Mode_Exit();

        /* If  RTC_CTRL_BYPS bit = 0, wait for synchro else this check is not needed */
        if ((RTC->CTRL & RTC_CTRL_BYPS) == RESET)
        {
            if (RTC_Wait_For_Synchronization() == ERROR)
            {
                status_value = ERROR;
            }
            else
            {
                status_value = SUCCESS;
            }
        }
        else
        {
            status_value = SUCCESS;
        }
        
        if(RTC_DelayCmd == ENABLE)
        {
            if(first_init_flag)
            {
                /* Clear the first initialization flag */
                first_init_flag = 0;
            }
            
#ifdef RTC_DELAY_USE_TIM6
            /* Set Interrupt Priority */            
            TIM6_NVIC_Init.NVIC_IRQChannel = TIM6_IRQn;
            TIM6_NVIC_Init.NVIC_IRQChannelPreemptionPriority = 0;
            TIM6_NVIC_Init.NVIC_IRQChannelSubPriority = 1;
            TIM6_NVIC_Init.NVIC_IRQChannelCmd = ENABLE;
            NVIC_Initializes(&TIM6_NVIC_Init);
            /* Enable the TIM6 clock*/
            RCC->APB1PCLKEN |= RCC_APB1_PERIPH_TIM6;
            RCC->APB1PRST |= RCC_APB1_PERIPH_TIM6;
            RCC->APB1PRST &= ~RCC_APB1_PERIPH_TIM6;
            /* Set the Autoreload value */
            TIM6->AR = RTC_DELAY_1S_RELOAD_VALUE_TIM6;
            /* Prescaler configuration */
            TIM6->PSC = RTC_DELAY_1S_PRESCALER_VALUE_TIM6 - 1;
            /* Set or reset the UG Bit */
            TIM6->EVTGEN = TIM_PSC_RELOAD_MODE_IMMEDIATE;
            /* TIM6 enable update irq */
            TIM6->DINTEN |= TIM_INT_UPDATE;
            /* Clear the flag */
            TIM6->STS &= (uint32_t)~TIM_FLAG_UPDATE;
            /* TIM6 enable counter */
            TIM6->CTRL1 |= TIM_CTRL1_CNTEN;
#else
            /* Set Interrupt Priority */
            NVIC_SetPriority (SysTick_IRQn, (1<<__NVIC_PRIO_BITS) - 1);
            /* set reload register */
            SysTick->LOAD  = (RTC_DELAY_1S_RELOAD_VALUE_SYSTICK & SysTick_LOAD_RELOAD_Msk) - 1;
            /* Load the SysTick Counter Value */
            SysTick->VAL   = 0;
            /* Enable SysTick IRQ and SysTick Timer */
            SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk |
                             SysTick_CTRL_TICKINT_Msk   |
                             SysTick_CTRL_ENABLE_Msk;
#endif
        }
    }
    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();

    return status_value;
}


/**
*\*\name    RTC_Date_Struct_Initializes.
*\*\fun     Fills each RTC_DateStruct member with its default value (Monday, January 01 xx00).
*\*\param   RTC_DateStruct : RTC_DateStruct pointer to a RTC_DateType structure that contains
*\*\                       the date configuration information for the RTC.
*\*\            - WeekDay 
*\*\                - RTC_WEEKDAY_MONDAY
*\*\                - RTC_WEEKDAY_TUESDAY
*\*\                - RTC_WEEKDAY_WEDNESDAY
*\*\                - RTC_WEEKDAY_THURSDAY
*\*\                - RTC_WEEKDAY_FRIDAY
*\*\                - RTC_WEEKDAY_SATURDAY
*\*\                - RTC_WEEKDAY_SUNDAY
*\*\            - Month 
*\*\                - RTC_MONTH_JANUARY
*\*\                - RTC_MONTH_FEBRURY
*\*\                - RTC_MONTH_MARCH
*\*\                - RTC_MONTH_APRIL
*\*\                - RTC_MONTH_MAY
*\*\                - RTC_MONTH_JUNE
*\*\                - RTC_MONTH_JULY
*\*\                - RTC_MONTH_AUGUST
*\*\                - RTC_MONTH_SEPTEMBER
*\*\                - RTC_MONTH_OCTOBER
*\*\                - RTC_MONTH_NOVEMBER
*\*\                - RTC_MONTH_DECEMBER
*\*\            - Date    the value in the 1-31 range 
*\*\            - Year    the value in the 0-99 range
*\*\return  none 
**/
void RTC_Date_Struct_Initializes(RTC_DateType* RTC_DateStruct)
{
    /* Monday, January 01 xx00 */
    RTC_DateStruct->WeekDay = RTC_WEEKDAY_MONDAY;
    RTC_DateStruct->Date    = 1;
    RTC_DateStruct->Month   = RTC_MONTH_JANUARY;
    RTC_DateStruct->Year    = 0;
}

/**
*\*\name    RTC_Date_Get.
*\*\fun      Get the RTC current date.
*\*\param   RTC_Format : specifies the format of the returned parameters.
*\*\            - RTC_FORMAT_BIN 
*\*\            - RTC_FORMAT_BCD 
*\*\param   RTC_DateType : RTC_DateStruct pointer to a RTC_DateType structure that will
*\*\                       contain the returned current date configuration.
*\*\return  none 
**/
void RTC_Date_Get(uint32_t RTC_Format, RTC_DateType* RTC_DateStruct)
{
    uint32_t temp_value = 0;

