SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rtc.c
    /* Clear the bits to be configured */
    RTC->CTRL &= (uint32_t) ~(RTC_CTRL_OUTSEL | RTC_CTRL_OPOL);

    /* Configure the output selection and polarity */
    RTC->CTRL |= (uint32_t)(RTC_Output | RTC_OutputPolarity);

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_Calibration_Output_Enable
*\*\fun     Enable the RTC clock to be output through the relative pin.
*\*\return  none
**/
void RTC_Calibration_Output_Enable(void)
{
    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Enable the RTC clock output */
    RTC->CTRL |= (uint32_t)RTC_CTRL_COEN;
    
    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_Calibration_Output_Disable
*\*\fun     Disable the RTC clock to be output through the relative pin.
*\*\return  none
**/
void RTC_Calibration_Output_Disable(void)
{
    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Disable the RTC clock output */
    RTC->CTRL &= (uint32_t)~RTC_CTRL_COEN;
    
    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_Calibration_Output_Config
*\*\fun     Configure the Calibration Pinout (RTC_CALIB) Selection (1Hz or 256Hz).
*\*\param   RTC_CalibOutput Select the Calibration output Selection .
*\*\            - RTC_CALIB_OUTPUT_256HZ : A signal has a regular waveform at 256Hz.
*\*\            - RTC_CALIB_OUTPUT_1HZ   : A signal has a regular waveform at 1Hz.
*\*\return  none
**/
void RTC_Calibration_Output_Config(uint32_t RTC_CalibOutput)
{
    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /*clear flags before config*/
    RTC->CTRL &= (uint32_t) ~(RTC_CTRL_CALOSEL);

    /* Configure the RTC_CTRL register */
    RTC->CTRL |= (uint32_t)RTC_CalibOutput;

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_Smooth_Calibration_Config
*\*\fun     Configures the Smooth Calibration Settings.
*\*\param   RTC_SmoothCalibPeriod : RTC_SmoothCalibPeriod Select the Smooth Calibration Period.
*\*\            - SMOOTH_CALIB_32SEC : The smooth calibration periode is 32s.
*\*\            - SMOOTH_CALIB_16SEC : The smooth calibration periode is 16s.
*\*\            - SMOOTH_CALIB_8SEC  : The smooth calibartion periode is 8s.
*\*\param   RTC_SmoothCalibPlusPulses : Set or reset the CALP bit.
*\*\            - RTC_SMOOTH_CALIB_PLUS_PULSES_SET : Add one RTCCLK puls every 2**11 pulses.
*\*\            - RTC_SMOOTH_CALIB_PLUS_PULSES_RESET : No RTCCLK pulses are added.
*\*\param   RTC_SmouthCalibMinusPulsesValue : Set the value of CALM[8:0] bits, the value in the 0-0x000001FF range 
*\*\return  ErrorStatus
*\*\            - SUCCESS : RTC Calib registers are configured
*\*\            - ERROR   : RTC Calib registers are not configured
**/
ErrorStatus RTC_Smooth_Calibration_Config(uint32_t RTC_SmoothCalibPeriod,
                                  uint32_t RTC_SmoothCalibPlusPulses,
                                  uint32_t RTC_SmouthCalibMinusPulsesValue)
{
    ErrorStatus status    = ERROR;
    uint32_t recalpfcount = 0;

    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* check if a calibration is pending*/
    if ((RTC->INITSTS & RTC_FLAG_RECPF) != RESET)
    {
        /* wait until the Calibration is completed*/
        while (((RTC->INITSTS & RTC_FLAG_RECPF) != RESET) && (recalpfcount != RECALPF_TIMEOUT))
        {
            recalpfcount++;
        }
    }

    /* check if the calibration pending is completed or if there is no calibration operation at all*/
    if ((RTC->INITSTS & RTC_FLAG_RECPF) == RESET)
    {
        /* Configure the Smooth calibration settings */
        RTC->CALIB = (uint32_t)((uint32_t)RTC_SmoothCalibPeriod | (uint32_t)RTC_SmoothCalibPlusPulses
                                | (uint32_t)RTC_SmouthCalibMinusPulsesValue);

        status = SUCCESS;
    }
    else
    {
        status = ERROR;
    }

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();

    return (ErrorStatus)(status);
}

/**
*\*\name    RTC_TimeStamp_Enable
*\*\fun     Enable the RTC TimeStamp functionality with the specified time stamp pin stimulating edge.
*\*\param   RTC_TimeStampEdge : Specifies the pin edge on which the TimeStamp is activated.
*\*\            - RTC_TIMESTAMP_EDGE_RISING : the Time stamp event occurs on the rising edge of the related pin.
*\*\            - RTC_TIMESTAMP_EDGE_FALLING : the Time stamp event occurs on the falling edge of the related pin.
*\*\return  none
**/
void RTC_TimeStamp_Enable(uint32_t RTC_TimeStampEdge)
{
    uint32_t temp_value = 0;

    /* Get the RTC_CTRL register and clear the bits to be configured */
    temp_value = (uint32_t)(RTC->CTRL & (uint32_t) ~(RTC_CTRL_TEDGE | RTC_CTRL_TSEN));

    /* Get the new configuration */

    temp_value |= (uint32_t)(RTC_TimeStampEdge | RTC_CTRL_TSEN);
    
    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Configure the Time Stamp TSEDGE and Enable bits */
    RTC->CTRL = (uint32_t)temp_value;

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_TimeStamp_Disable
*\*\fun     Disable the RTC TimeStamp functionality
*\*\param   none
*\*\return  none
**/
void RTC_TimeStamp_Disable(void)
{
    uint32_t temp_value = 0;

    /* Get the RTC_CTRL register and clear the bits to be configured */
    temp_value = (uint32_t)(RTC->CTRL & (uint32_t) ~(RTC_CTRL_TEDGE | RTC_CTRL_TSEN));

    /* Disable the write protection for RTC registers */
    RTC_Write_Protection_Disable();

    /* Configure the Time Stamp TSEDGE and Enable bits */
    RTC->CTRL = (uint32_t)temp_value;

    /* Enable the write protection for RTC registers */
    RTC_Write_Protection_Enable();
}

/**
*\*\name    RTC_TimeStamp_Get
*\*\fun     Get the RTC TimeStamp value and masks.
*\*\param   RTC_Format : specifies the format of the output parameters.
*\*\            - RTC_FORMAT_BIN : Binary data format
*\*\            - RTC_FORMAT_BCD : BCD data format
*\*\param   RTC_StampTimeStruct : pointer to a RTC_TimeType structure that will
*\*\        contains the TimeStamp time values.
*\*\param   RTC_StampDateStruct : pointer to a RTC_DateType structure that will
*\*\        contains the TimeStamp date values.
*\*\return  none
**/
void RTC_TimeStamp_Get(uint32_t RTC_Format, RTC_TimeType* RTC_StampTimeStruct, RTC_DateType* RTC_StampDateStruct)
{
    uint32_t tmptime = 0, tmpdate = 0;

