SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rtc.c
    /* Get the status of the Interrupt */
    if ((status_value != (uint32_t)RESET) && ((temp_value & 0x0000FFFF) != (uint32_t)RESET))
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
*\*\name    RTC_Interrupt_Status_Clear
*\*\fun     Clears the RTC's interrupt pending bits.
*\*\param   RTC_INT : specifies the RTC interrupt pending bit to clear.
*\*\          - RTC_INT_TAMP3 : Tamper3 interrupt.
*\*\          - RTC_INT_TAMP2 : Tamper2 interrupt.
*\*\          - RTC_INT_TAMP1 : Tamper1 interrupt.
*\*\          - RTC_INT_TST   : Timestamp interrupt.
*\*\          - RTC_INT_WUT   : WakeUp Timer interrupt
*\*\          - RTC_INT_ALRB  : Alarm B interrupt
*\*\          - RTC_INT_ALRA  : Alarm A interrupt
*\*\return  none
**/
void RTC_Interrupt_Status_Clear(uint32_t RTC_INT)
{
    uint32_t temp_value = 0;

    /* Get the RTC_INITSTS Interrupt pending bits mask */
    temp_value = (uint32_t)(RTC_INT >> 4);

    /* Clear the interrupt pending bits in the RTC_INITSTS register */
    RTC->INITSTS = (uint32_t)((uint32_t)(~((temp_value | RTC_FLAG_INITM) & 0x0000FFFF) | (uint32_t)(RTC->INITSTS & RTC_FLAG_INITM))); 

}

/**
*\*\name    RTC_Tamper_Trigger_Config
*\*\fun     Configures the select Tamper pin edge.
*\*\param   RTC_Tamper: Selected tamper pin.
*\*\          - RTC_TAMPER_1: Select Tamper 1.
*\*\          - RTC_TAMPER_2: Select Tamper 2.
*\*\          - RTC_TAMPER_3: Select Tamper 3.
*\*\param   RTC_TamperTrigger: Specifies the trigger on the tamper pin that stimulates tamper event. 
*\*\          - RTC_TamperTrigger_RisingEdge: Rising Edge of the tamper pin causes tamper event.
*\*\          - RTC_TamperTrigger_FallingEdge: Falling Edge of the tamper pin causes tamper event.
*\*\          - RTC_TamperTrigger_LowLevel: Low Level of the tamper pin causes tamper event.
*\*\          - RTC_TamperTrigger_HighLevel: High Level of the tamper pin causes tamper event.
*\*\return  none
**/
void RTC_Tamper_Trigger_Config(uint32_t RTC_Tamper, uint32_t RTC_TamperTrigger)
{
    if (RTC_Tamper == RTC_TAMPER_3)
    {
        RTC_TamperTrigger <<= 5;
    }  
    else if (RTC_Tamper == RTC_TAMPER_2)
    {
        RTC_TamperTrigger <<= 3;
    }     
    /* Configure the RTC_TAMPCR register */
    RTC->TMPCFG |= (uint32_t)(RTC_Tamper | RTC_TamperTrigger);     
    
}

/**
*\*\name    RTC_Tamper_Enable
*\*\fun     Enable the Tamper detection.
*\*\param   RTC_Tamper: Selected tamper pin.
*\*\          - RTC_TAMPER_1: Select Tamper 1.
*\*\          - RTC_TAMPER_2: Select Tamper 2.
*\*\          - RTC_TAMPER_3: Select Tamper 3.
*\*\return  none
**/
void RTC_Tamper_Enable(uint32_t RTC_Tamper)
{
    /* Enable the selected Tamper pin */
    RTC->TMPCFG |= (uint32_t)RTC_Tamper;
}

/**
*\*\name    RTC_Tamper_Disable
*\*\fun     Disable the Tamper detection.
*\*\param   RTC_Tamper: Selected tamper pin.
*\*\          - RTC_TAMPER_1: Select Tamper 1.
*\*\          - RTC_TAMPER_2: Select Tamper 2.
*\*\          - RTC_TAMPER_3: Select Tamper 3.
*\*\return  none
**/
void RTC_Tamper_Disable(uint32_t RTC_Tamper)
{
    /* Disable the selected Tamper pin */
    RTC->TMPCFG &= (uint32_t)~RTC_Tamper;    

}

/**
*\*\name    RTC_Tamper_Filter_Config
*\*\fun     Configures the Tampers Filter.
*\*\param   RTC_TamperFilter: Selected tamper pin.
*\*\            - RTC_TamperFilter_Disable: Tamper filter is disabled.
*\*\            - RTC_TamperFilter_2Sample: Tamper is activated after 2 consecutive samples at the active level.
*\*\            - RTC_TamperFilter_4Sample: Tamper is activated after 4 consecutive samples at the active level.
*\*\            - RTC_TamperFilter_8Sample: Tamper is activated after 8 consecutive samples at the active level.
*\*\return  none
**/
void RTC_Tamper_Filter_Config(uint32_t RTC_TamperFilter)
{   
    /* Clear TAMPFLT[1:0] bits in the RTC_TAMPCR register */
    RTC->TMPCFG &= (uint32_t)~(RTC_TMPCFG_TPFLT);

    /* Configure the RTC_TAMPCR register */
    RTC->TMPCFG |= (uint32_t)RTC_TamperFilter;
}

/**
*\*\name    RTC_Tamper_Sampling_Frequency_Config
*\*\fun     Configures the Tampers Sampling Frequency.
*\*\param   RTC_TamperSamplingFreq: Selected tamper pin.
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div32768
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div16384
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div8192
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div4096
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div2048
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div1024
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div512
*\*\            - RTC_TamperSamplingFreq_RTCCLK_Div256
*\*\return  none
**/
void RTC_Tamper_Sampling_Frequency_Config(uint32_t RTC_TamperSamplingFreq)
{ 
  /* Clear TAMPFREQ[2:0] bits in the RTC_TAMPCR register */
  RTC->TMPCFG &= (uint32_t)~(RTC_TAMPCR_TAMPFREQ);

  /* Configure the RTC_TAMPCR register */
  RTC->TMPCFG |= (uint32_t)RTC_TamperSamplingFreq;
}

/**
*\*\name    RTC_Tamper_Pins_Precharge_Duration
*\*\fun     Configures the Tampers Pins input Precharge Duration.
*\*\param   RTC_TamperPrechargeDuration: Selected tamper pin.
*\*\            - RTC_TamperPrechargeDuration_1RTCCLK
*\*\            - RTC_TamperPrechargeDuration_2RTCCLK
*\*\            - RTC_TamperPrechargeDuration_4RTCCLK
*\*\            - RTC_TamperPrechargeDuration_8RTCCLK
*\*\return  none
**/
void RTC_Tamper_Pins_Precharge_Duration(uint32_t RTC_TamperPrechargeDuration)
{   
  /* Clear TAMPPRCH[1:0] bits in the RTC_TAMPCR register */
  RTC->TMPCFG &= (uint32_t)~(RTC_TMPCFG_TPPRCH);

  /* Configure the RTC_TAMPCR register */
  RTC->TMPCFG |= (uint32_t)RTC_TamperPrechargeDuration;
}

/**
*\*\name    RTC_TimeStamp_On_Tamper_Detection_Enable
*\*\fun     The timestamp is valid even the TSEN bit in tamper control register is reset.   
*\*\param   none
*\*\return  none
**/
void RTC_TimeStamp_On_Tamper_Detection_Enable(void)
{   
    /* Save timestamp on tamper detection event */
    RTC->TMPCFG |= (uint32_t)RTC_TMPCFG_TPTS;
}

/**
*\*\name    RTC_TimeStamp_On_Tamper_Detection_Disable
*\*\fun     The timestamp is invalid even the TSEN bit in tamper control register is reset.   
*\*\param   none
*\*\return  none
**/
void RTC_TimeStamp_On_Tamper_Detection_Disable(void)
{   
    /* Tamper detection does not cause a timestamp to be saved */
    RTC->TMPCFG &= (uint32_t)~RTC_TMPCFG_TPTS;    
}

/**
*\*\name    RTC_Tamper_Precharge_Enable
*\*\fun     Enable the Precharge of Tamper pin. 
*\*\param   none
*\*\return  none
**/
void RTC_Tamper_Precharge_Enable(void)
{  
    /* Enable precharge of the selected Tamper pin */
    RTC->TMPCFG &= (uint32_t)~RTC_TMPCFG_TPPUDIS; 
}

/**
*\*\name    RTC_Tamper_Precharge_Disable
*\*\fun     Enables or Disables the Precharge of Tamper pin. 
*\*\param   none
*\*\return  none
**/
void RTC_Tamper_Precharge_Disable(void)
{  
    /* Disable precharge of the selected Tamper pin */
    RTC->TMPCFG |= (uint32_t)RTC_TMPCFG_TPPUDIS;    
}

/**
*\*\name    RTC_Tamper_Interrput_Enable
*\*\fun     Enable the Tamper interrupt.
*\*\param   TAMPx_INT: Selected tamper number.
*\*\            - RTC_TAMPER1_INT
*\*\            - RTC_TAMPER2_INT
*\*\            - RTC_TAMPER3_INT
*\*\return  none
**/
void RTC_Tamper_Interrput_Enable(uint32_t TAMPx_INT)
{
    /* Enable the selected Tamper pin */
    RTC->TMPCFG |= (uint32_t)TAMPx_INT;
}

/**
*\*\name    RTC_Tamper_Interrput_Disable
*\*\fun     Disable the Tamper interrupt.
*\*\param   TAMPx_INT: Selected tamper number.
*\*\            - RTC_TAMPER1_INT
*\*\            - RTC_TAMPER2_INT
*\*\            - RTC_TAMPER3_INT
*\*\return  none
**/
void RTC_Tamper_Interrput_Disable(uint32_t TAMPx_INT)
{
    /* Disable the selected Tamper pin */
    RTC->TMPCFG &= (uint32_t)~TAMPx_INT;
}

/**
*\*\name    RTC_Tamper_Backup_Register_Clear_Disable
*\*\fun     Enable the Tamper do not clear backup register.
*\*\param   RTC_Tamper: Selected tamper event.
*\*\          - RTC_TAMPER1_NOE: Select Tamper 1.
*\*\          - RTC_TAMPER2_NOE: Select Tamper 2.
*\*\          - RTC_TAMPER3_NOE: Select Tamper 3.
*\*\return  none
**/
void RTC_Tamper_Backup_Register_Clear_Disable(uint32_t RTC_TAMPERx_NOE)
{
    /* Enable Tamper clear backup register */
    RTC->TMPCFG |= (uint32_t)RTC_TAMPERx_NOE;
}

/**
*\*\name    RTC_Tamper_Backup_Register_Clear_Enable
*\*\fun     Enable the Tamper clear backup register.
*\*\param   RTC_Tamper: Selected tamper event.
*\*\          - RTC_TAMPER1_NOE: Select Tamper 1.
*\*\          - RTC_TAMPER2_NOE: Select Tamper 2.
*\*\          - RTC_TAMPER3_NOE: Select Tamper 3.
*\*\return  none
**/
void RTC_Tamper_Backup_Register_Clear_Enable(uint32_t RTC_TAMPERx_NOE)
{
    /* Enable Tamper clear backup register */
    RTC->TMPCFG &= (uint32_t)~RTC_TAMPERx_NOE;
}

/**
*\*\name    RTC_Backup_Registers_Write
*\*\fun     Write a data in a specified RTC Backup data register.
*\*\param   register_num: Selected register number.
*\*\            RTC_BACKUP_REGISTER_1
*\*\            RTC_BACKUP_REGISTER_2
*\*\            RTC_BACKUP_REGISTER_3
*\*\            RTC_BACKUP_REGISTER_4
*\*\            RTC_BACKUP_REGISTER_5
*\*\            RTC_BACKUP_REGISTER_6
*\*\            RTC_BACKUP_REGISTER_7
*\*\            RTC_BACKUP_REGISTER_8
*\*\            RTC_BACKUP_REGISTER_9
*\*\            RTC_BACKUP_REGISTER_10
*\*\            RTC_BACKUP_REGISTER_11
*\*\            RTC_BACKUP_REGISTER_12
*\*\            RTC_BACKUP_REGISTER_13
*\*\            RTC_BACKUP_REGISTER_14
*\*\            RTC_BACKUP_REGISTER_15
*\*\            RTC_BACKUP_REGISTER_16
*\*\            RTC_BACKUP_REGISTER_17
*\*\            RTC_BACKUP_REGISTER_18
*\*\            RTC_BACKUP_REGISTER_19
*\*\            RTC_BACKUP_REGISTER_20
*\*\param   Data: Data write.
*\*\return  none
**/
void RTC_Backup_Register_Write(RTC_BACKUP_REGISTER register_num, uint32_t Data)
{
    volatile uint32_t *temp_value;

    temp_value = &RTC->BKP1R;
    temp_value += (register_num-1);

    /* Write register */
    *(__IO uint32_t *)temp_value = (uint32_t)Data;
}

/**
*\*\name    RTC_Backup_Register_Read
*\*\fun     Read a data in a specified RTC Backup data register.
*\*\param   register_num: Selected register number.
*\*\            RTC_BACKUP_REGISTER_1
*\*\            RTC_BACKUP_REGISTER_2
*\*\            RTC_BACKUP_REGISTER_3
*\*\            RTC_BACKUP_REGISTER_4
*\*\            RTC_BACKUP_REGISTER_5
*\*\            RTC_BACKUP_REGISTER_6
*\*\            RTC_BACKUP_REGISTER_7
*\*\            RTC_BACKUP_REGISTER_8
*\*\            RTC_BACKUP_REGISTER_9
*\*\            RTC_BACKUP_REGISTER_10
*\*\            RTC_BACKUP_REGISTER_11
*\*\            RTC_BACKUP_REGISTER_12
*\*\            RTC_BACKUP_REGISTER_13
*\*\            RTC_BACKUP_REGISTER_14
*\*\            RTC_BACKUP_REGISTER_15
*\*\            RTC_BACKUP_REGISTER_16
*\*\            RTC_BACKUP_REGISTER_17
*\*\            RTC_BACKUP_REGISTER_18
*\*\            RTC_BACKUP_REGISTER_19
*\*\            RTC_BACKUP_REGISTER_20
*\*\return  Register data
**/
uint32_t RTC_Backup_Register_Read(RTC_BACKUP_REGISTER register_num)
{
    volatile uint32_t *temp_value;

    temp_value = &RTC->BKP1R;
    temp_value += (register_num-1);

    /* Read register */
    return (*(__IO uint32_t *)temp_value);
}

/**
*\*\name    RTC_Byte_To_Bcd2
*\*\fun     Converts a 2 digit decimal to BCD format.
*\*\param   value : Value Byte to be converted.
*\*\return  Converted byte
**/
static uint8_t RTC_Byte_To_Bcd2(uint8_t value)
{
    uint8_t temp_value = 0;

    while (value >= 10)
    {
        temp_value++;
        value -= 10;
    }
    return ((uint8_t)(temp_value << 4) | value);
}

/**
*\*\name    RTC_Bcd2_To_Byte
*\*\fun     Convert from 2 digit BCD to Binary.
*\*\param   Value : Value BCD value to be converted.
*\*\return  Converted byte
**/
static uint8_t RTC_Bcd2_To_Byte(uint8_t value)
{
    uint8_t temp_value = 0;
    temp_value = ((uint8_t)(value & (uint8_t)0xF0) >> (uint8_t)0x4) * 10;
    return (temp_value + (value & (uint8_t)0x0F));
}

/**
*\*\}
 */
